<script setup lang="ts">
import Prism from 'prismjs'
import 'prismjs/themes/prism.css'
import 'prismjs/components/prism-json'

const req1 = `
Παραδειγμα αιτήματος
{
    "name": "Μαρ"
}
`
const resp1 = `
Παραδειγμα απάντησης
[
    "ΧΑΣΑΠΗ ΜΑΡΙΑ",
    "ΚΑΡΑΔΗΜΑ ΜΑΡΙΓΙΑΝΝΑ",
    "ΜΑΡΚΑΚΗ ΔΗΜΗΤΡΑ",
    "ΚΟΣΜΑΡΙΚΟΥ ΔΗΜΗΤΡΑ",
    "ΚΙΟΠΡΟΥΛΗ ΜΑΡΙΑ",
    "ΑΥΓΕΡΙΝΟΥΔΗ ΔΗΜΗΤΡΑ ΜΑΡΙΑ",
    "ΤΡΙΑΝΤΑΦΥΛΛΙΔΟΥ ΜΑΡΙΑ ΑΝΝΑ",
    "ΚΕΜΠΕΣΟΥ ΜΑΡΙΑΝΘΗ",
    "ΚΟΥΤΣΟΥΜΑΡΗ ΝΙΚΟΛΕΤΤΑ",
    "ΦΙΛΙΠΠΟΠΟΥΛΟΥ ΜΑΡΙΑ"
]
`
const req2 = `
Παραδειγμα αιτήματος
http://localhost:5173/onoma/ΒΟΥΓΙΟΥΚΑ_ΜΑΡΙΑ
`
const resp2 = `
Παραδειγμα απάντησης
[
    {
        "Typos": "ΓΕΝΙΚΗΣ",
        "Eponymo": "ΒΟΥΓΙΟΥΚΑ",
        "Onoma": "ΜΑΡΙΑ",
        "Patronymo": "ΓΕΩΡΓΙΟΣ",
        "Klados": "ΠΕ79.01",
        "Seira_Pinaka": 640,
        "Moria_Pinaka": 30.039,
        "Perioxh_Topothethshs": "Α ΣΑΜΟΥ",
        "Dieytynsh_Ekpaideyshs": "ΠΕ ΣΑΜΟΥ",
        "Hmeromnia": "2018-09-04T21:00:00.000Z",
        "Etos": "2018-2019",
        "Sxolia": "ΑΠΩ"
    },
    {
        "Typos": "ΓΕΝΙΚΗΣ",
        "Eponymo": "ΒΟΥΓΙΟΥΚΑ",
        "Onoma": "ΜΑΡΙΑ",
        "Patronymo": "ΓΕΩΡΓΙΟΣ",
        "Klados": "ΠΕ79.01/ΤΕ16",
        "Seira_Pinaka": 654,
        "Moria_Pinaka": 52,
        "Perioxh_Topothethshs": "Α ΛΕΣΒΟΥ",
        "Dieytynsh_Ekpaideyshs": "ΠΕ ΛΕΣΒΟΥ",
        "Hmeromnia": "2019-08-24T21:00:00.000Z",
        "Etos": "2019-2020",
        "Sxolia": "ΑΠΩ"
    },
    {
        "Typos": "ΓΕΝΙΚΗΣ",
        "Eponymo": "ΒΟΥΓΙΟΥΚΑ",
        "Onoma": "ΜΑΡΙΑ",
        "Patronymo": "ΓΕΩΡΓΙΟΣ",
        "Klados": "ΠΕ79.01/ΤΕ16",
        "Seira_Pinaka": 672,
        "Moria_Pinaka": 77.83,
        "Perioxh_Topothethshs": "Α ΛΕΣΒΟΥ",
        "Dieytynsh_Ekpaideyshs": "ΠΕ ΛΕΣΒΟΥ",
        "Hmeromnia": "2020-08-24T21:00:00.000Z",
        "Etos": "2020-2021",
        "Sxolia": "ΑΠΩ"
    },
    {
        "Typos": "ΓΕΝΙΚΗΣ",
        "Eponymo": "ΒΟΥΓΙΟΥΚΑ",
        "Onoma": "ΜΑΡΙΑ",
        "Patronymo": "ΓΕΩΡΓΙΟΣ",
        "Klados": "ΠΕ79.01",
        "Seira_Pinaka": 679,
        "Moria_Pinaka": 77.83,
        "Perioxh_Topothethshs": "Α ΛΕΣΒΟΥ",
        "Dieytynsh_Ekpaideyshs": "ΠΕ ΛΕΣΒΟΥ",
        "Hmeromnia": "2021-08-25T21:00:00.000Z",
        "Etos": "2021-2022",
        "Sxolia": "ΑΠΩ"
    },
    {
        "Typos": "ΓΕΝΙΚΗΣ",
        "Eponymo": "ΒΟΥΓΙΟΥΚΑ",
        "Onoma": "ΜΑΡΙΑ",
        "Patronymo": "ΑΡΙΣΤΕΙΔΗΣ",
        "Klados": "ΠΕ02",
        "Seira_Pinaka": 4483,
        "Moria_Pinaka": 57.95,
        "Perioxh_Topothethshs": "Α ΣΑΜΟΥ",
        "Dieytynsh_Ekpaideyshs": "ΔΕ ΣΑΜΟΥ",
        "Hmeromnia": "2022-08-25T21:00:00.000Z",
        "Etos": "2022-2023",
        "Sxolia": "ΑΠΩ"
    },
    {
        "Typos": "ΜΟΥΣΙΚΑ",
        "Eponymo": "ΒΟΥΓΙΟΥΚΑ",
        "Onoma": "ΜΑΡΙΑ",
        "Patronymo": "ΓΕΩΡΓΙΟΣ",
        "Klados": "ΠΕ79.01/ΤΕ16",
        "Seira_Pinaka": 50,
        "Moria_Pinaka": 124,
        "Perioxh_Topothethshs": "Μουσικό Σχολείο Μυτιλήνης",
        "Dieytynsh_Ekpaideyshs": "ΔΕ ΛΕΣΒΟΥ",
        "Hmeromnia": "2022-08-25T21:00:00.000Z",
        "Etos": "2022-2023",
        "Sxolia": "ΑΜΩ,Θεωρητικά Βυζαντινής Μουσικής"
    }
]
`
const req3 = `
Παραδειγμα αιτήματος
http://localhost:5173/user/ΒΟΥΓΙΟΥΚΑ/ΜΑΡΙΑ/ΓΕΩΡΓΙΟΣ
`
const resp3 = `
Παραδειγμα απάντησης
[
    {
        "Typos": "ΓΕΝΙΚΗΣ",
        "Eponymo": "ΒΟΥΓΙΟΥΚΑ",
        "Onoma": "ΜΑΡΙΑ",
        "Patronymo": "ΓΕΩΡΓΙΟΣ",
        "Klados": "ΠΕ79.01",
        "Seira_Pinaka": 640,
        "Moria_Pinaka": 30.039,
        "Perioxh_Topothethshs": "Α ΣΑΜΟΥ",
        "Dieytynsh_Ekpaideyshs": "ΠΕ ΣΑΜΟΥ",
        "Hmeromnia": "2018-09-04T21:00:00.000Z",
        "Etos": "2018-2019",
        "Sxolia": "ΑΠΩ"
    },
    {
        "Typos": "ΓΕΝΙΚΗΣ",
        "Eponymo": "ΒΟΥΓΙΟΥΚΑ",
        "Onoma": "ΜΑΡΙΑ",
        "Patronymo": "ΓΕΩΡΓΙΟΣ",
        "Klados": "ΠΕ79.01/ΤΕ16",
        "Seira_Pinaka": 654,
        "Moria_Pinaka": 52,
        "Perioxh_Topothethshs": "Α ΛΕΣΒΟΥ",
        "Dieytynsh_Ekpaideyshs": "ΠΕ ΛΕΣΒΟΥ",
        "Hmeromnia": "2019-08-24T21:00:00.000Z",
        "Etos": "2019-2020",
        "Sxolia": "ΑΠΩ"
    },
    {
        "Typos": "ΓΕΝΙΚΗΣ",
        "Eponymo": "ΒΟΥΓΙΟΥΚΑ",
        "Onoma": "ΜΑΡΙΑ",
        "Patronymo": "ΓΕΩΡΓΙΟΣ",
        "Klados": "ΠΕ79.01/ΤΕ16",
        "Seira_Pinaka": 672,
        "Moria_Pinaka": 77.83,
        "Perioxh_Topothethshs": "Α ΛΕΣΒΟΥ",
        "Dieytynsh_Ekpaideyshs": "ΠΕ ΛΕΣΒΟΥ",
        "Hmeromnia": "2020-08-24T21:00:00.000Z",
        "Etos": "2020-2021",
        "Sxolia": "ΑΠΩ"
    },
    {
        "Typos": "ΓΕΝΙΚΗΣ",
        "Eponymo": "ΒΟΥΓΙΟΥΚΑ",
        "Onoma": "ΜΑΡΙΑ",
        "Patronymo": "ΓΕΩΡΓΙΟΣ",
        "Klados": "ΠΕ79.01",
        "Seira_Pinaka": 679,
        "Moria_Pinaka": 77.83,
        "Perioxh_Topothethshs": "Α ΛΕΣΒΟΥ",
        "Dieytynsh_Ekpaideyshs": "ΠΕ ΛΕΣΒΟΥ",
        "Hmeromnia": "2021-08-25T21:00:00.000Z",
        "Etos": "2021-2022",
        "Sxolia": "ΑΠΩ"
    },
    {
        "Typos": "ΜΟΥΣΙΚΑ",
        "Eponymo": "ΒΟΥΓΙΟΥΚΑ",
        "Onoma": "ΜΑΡΙΑ",
        "Patronymo": "ΓΕΩΡΓΙΟΣ",
        "Klados": "ΠΕ79.01/ΤΕ16",
        "Seira_Pinaka": 50,
        "Moria_Pinaka": 124,
        "Perioxh_Topothethshs": "Μουσικό Σχολείο Μυτιλήνης",
        "Dieytynsh_Ekpaideyshs": "ΔΕ ΛΕΣΒΟΥ",
        "Hmeromnia": "2022-08-25T21:00:00.000Z",
        "Etos": "2022-2023",
        "Sxolia": "ΑΜΩ,Θεωρητικά Βυζαντινής Μουσικής"
    }
]
`
const req4 = `
Παραδειγμα αιτήματος
http://localhost:5173/typos
`
const resp4 = `
Παραδειγμα απάντησης
[
    "ΜΟΥΣΙΚΑ",
    "ΓΕΝΙΚΗΣ",
    "ΕΙΔΙΚΗΣ"
]
`
const req5 = `
Παραδειγμα αιτήματος
http://localhost:5173/klados
`
const resp5 = `
Παραδειγμα απάντησης
[
    "ΠΕ79.01/ΤΕ16",
    "ΠΕ01",
    "ΠΕ02",
    "ΠΕ03",
    "ΠΕ04.01",
    "ΠΕ04.02",
    "ΠΕ04.04",
    "ΠΕ04.05",
    "ΠΕ05",
    "ΠΕ06",
    "ΠΕ07",
    "ΠΕ08",
    "ΠΕ11",
    "ΠΕ78",
    "ΠΕ80",
    "ΠΕ81",
    "ΠΕ82",
    "ΠΕ83",
    "ΠΕ84",
    "ΠΕ85",
    "ΠΕ86",
    "ΠΕ87.01",
    "ΠΕ87.02",
    "ΠΕ87.03",
    "ΠΕ87.04",
    "ΠΕ87.08",
    "ΠΕ87.09",
    "ΠΕ88.01",
    "ΠΕ88.02",
    "ΠΕ88.03",
    "ΠΕ88.04",
    "ΠΕ88.05",
    "ΠΕ89.01",
    "ΠΕ89.02",
    "ΤΕ01.19",
    "ΤΕ02.02",
    "ΠΕ60",
    "ΠΕ70",
    "ΠΕ91.01",
    "ΠΕ91.02",
    "ΠΕ79.01",
    "ΠΕ90",
    "ΠΕ04",
    "ΠΕ87",
    "ΠΕ88",
    "ΠΕ89",
    "ΠΕ91",
    "ΤΕ01.13",
    "ΤΕ01.20",
    "ΤΕ02",
    "ΠΕ87.05",
    "ΠΕ87.06",
    "ΠΕ61",
    "ΠΕ60.ΕΑΕ",
    "ΠΕ71",
    "ΠΕ70.ΕΑΕ",
    "ΤΕ16.00",
    "ΤΕ02.04",
    "ΤΕ02.06",
    "ΠΕ06.ΕΑΕ",
    "ΠΕ08.ΕΑΕ",
    "ΠΕ11.ΕΑΕ",
    "ΠΕ79.01.ΕΑΕ",
    "ΤΕ16.00.ΕΑΕ",
    "ΠΕ86.ΕΑΕ",
    "ΠΕ02.ΕΑΕ",
    "ΠΕ04.01.ΕΑΕ",
    "ΤΕ01.25",
    "ΠΕ16.01",
    "ΠΕ20.ΕΑΕ",
    "ΠΕ19.ΕΑΕ",
    "ΠΕ33",
    "ΠΕ34",
    "ΠΕ87.07",
    "ΠΕ87.10",
    "ΔΕ02.01",
    "ΔΕ01",
    "ΠΕ21",
    "ΠΕ22",
    "ΠΕ23",
    "ΠΕ25",
    "ΠΕ28",
    "ΠΕ29",
    "ΠΕ30",
    "ΤΕ02.07",
    "ΤΕ01.07"
]
`
const req6 = `
Παραδειγμα αιτήματος
http://localhost:5173/perioxh
`
const resp6 = `
Παραδειγμα απάντησης
[
    "Μουσικό Σχολείο Γιαννιτσών",
    "Μουσικό Σχολείο Δυτικής Λέσβου",
    "Μουσικό Σχολείο Πρέβεζας",
    "Μουσικό Σχολείο Χίου",
    "Μουσικό Σχολείο Πειραιά",
    "Μουσικό Σχολείο Αγρινίου",
    "Μουσικό Σχολείο Αλίμου",
    "Μουσικό Σχολείο Ηρακλείου",
    "Μουσικό Σχολείο Ζακύνθου",
    "Μουσικό Σχολείο Λασιθίου",
    "Μουσικό Σχολείο Πάτρας",
    "Μουσικό Σχολείο Ξάνθης",
    "ΛΑΡΙΣΑΣ",
    "ΚΑΡΔΙΤΣΑΣ",
    "Β ΘΕΣΣΑΛΟΝΙΚΗΣ",
    "Α ΜΑΓΝΗΣΙΑΣ",
    "ΣΕΡΡΩΝ",
    "ΧΑΛΚΙΔΙΚΗΣ",
    "Β ΑΘΗΝΑΣ",
    "Δ ΑΘΗΝΑΣ",
    "ΧΑΝΙΩΝ",
    "ΚΟΖΑΝΗΣ",
    "ΦΘΙΩΤΙΔΑΣ",
    "Α ΑΘΗΝΑΣ",
    "ΙΩΑΝΝΙΝΩΝ",
    "Γ ΑΘΗΝΑΣ",
    "Α ΑΝΑΤ. ΑΤΤΙΚΗΣ",
    "Α ΛΕΣΒΟΥ",
    "ΔΥΤ. ΑΤΤΙΚΗΣ",
    "Α ΕΥΒΟΙΑΣ",
    "Δ ΚΥΚΛΑΔΩΝ",
    "Β ΠΕΙΡΑΙΑ",
    "Α ΠΕΙΡΑΙΑ",
    "Α ΔΩΔΕΚΑΝΗΣΟΥ",
    "ΜΕΣΣΗΝΙΑΣ",
    "Α ΚΕΡΚΥΡΑΣ",
    "ΛΑΣΙΘΙΟΥ",
    "ΗΡΑΚΛΕΙΟΥ",
    "ΡΕΘΥΜΝΟΥ",
    "ΑΙΤΩΛΟΑΚΑΡΝΑΝΙΑΣ",
    "Β ΑΝΑΤ. ΑΤΤΙΚΗΣ",
    "ΒΟΙΩΤΙΑΣ",
    "ΚΟΡΙΝΘΙΑΣ",
    "ΑΡΚΑΔΙΑΣ",
    "ΗΛΕΙΑΣ",
    "ΑΧΑΪΑΣ",
    "ΡΟΔΟΠΗΣ",
    "Α ΘΕΣΣΑΛΟΝΙΚΗΣ",
    "Α ΧΙΟΥ",
    "Β ΛΕΣΒΟΥ",
    "ΑΡΤΑΣ",
    "Β ΧΙΟΥ",
    "ΠΙΕΡΙΑΣ",
    "ΗΜΑΘΙΑΣ",
    "ΠΡΕΒΕΖΑΣ",
    "ΖΑΚΥΝΘΟΥ",
    "Α ΣΑΜΟΥ",
    "ΚΙΛΚΙΣ",
    "ΦΛΩΡΙΝΑΣ",
    "ΠΕΛΛΑΣ",
    "ΚΑΣΤΟΡΙΑΣ",
    "Γ ΚΥΚΛΑΔΩΝ",
    "ΛΑΚΩΝΙΑΣ",
    "ΔΡΑΜΑΣ",
    "Α ΚΑΒΑΛΑΣ",
    "ΤΡΙΚΑΛΩΝ",
    "ΑΡΓΟΛΙΔΑΣ",
    "ΞΑΝΘΗΣ",
    "Α ΕΒΡΟΥ",
    "Β ΔΩΔΕΚΑΝΗΣΟΥ",
    "Δ ΔΩΔΕΚΑΝΗΣΟΥ",
    "Β ΕΥΒΟΙΑΣ",
    "Α ΚΕΦΑΛΛΗΝΙΑΣ",
    "ΗΡΑΚΛΕΙΟΥ– Σχολείο Ευρωπαϊκής Παιδείας",
    "Β ΚΥΚΛΑΔΩΝ",
    "Β ΜΑΓΝΗΣΙΑΣ",
    "ΘΕΣΠΡΩΤΙΑΣ",
    "Β ΚΕΦΑΛΛΗΝΙΑΣ",
    "Α ΚΥΚΛΑΔΩΝ",
    "Β ΣΑΜΟΥ",
    "ΦΩΚΙΔΑΣ",
    "ΛΕΥΚΑΔΑΣ",
    "ΕΥΡΥΤΑΝΙΑΣ",
    "Β ΚΑΒΑΛΑΣ",
    "Γ ΣΑΜΟΥ",
    "ΓΡΕΒΕΝΩΝ",
    "Γ ΔΩΔΕΚΑΝΗΣΟΥ",
    "Β ΕΒΡΟΥ",
    "Γ ΠΕΙΡΑΙΑ",
    "Σιβιτανίδειος",
    "Β ΚΕΡΚΥΡΑΣ",
    "Γ ΛΕΣΒΟΥ",
    "Α ΕΒΡΟΥ– Μειονοτικά - ελληνόγλωσσο πρόγραμμα",
    "ΡΟΔΟΠΗΣ– Μειονοτικά - ελληνόγλωσσο πρόγραμμα",
    "ΚΑΛΛΙΤΕΧΝΙΚΟ ΓΥΜΝΑΣΙΟ ΑΜΠΕΛΟΚΗΠΩΝ ΘΕΣΣΑΛΟΝΙΚΗΣΚΑΙ ΚΑΛΛΙΤΕΧΝΙΚΟ ΛΥΚΕΙΟ ΣΤΑΥΡΟΥΠΟΛΗΣ ΘΕΣΣΑΛΟΝΙΚΗΣ",
    "ΚΑΛΛΙΤΕΧΝΙΚΟ ΣΧΟΛΕΙΟ ΓΕΡΑΚΑ ΑΤΤΙΚΗΣ",
    "ΚΑΛΛΙΤΕΧΝΙΚΟ ΓΥΜΝΑΣΙΟ ΚΕΡΑΤΣΙΝΙΟΥ ΔΡΑΠΕΤΣΩΝΑΣ",
    "ΚΑΛΛΙΤΕΧΝΙΚΟ ΓΥΜΝΑΣΙΟ ΠΕΡΙΣΤΕΡΙΟΥ",
    "ΚΑΛΛΙΤΕΧΝΙΚΟ ΣΧΟΛΕΙΟ ΗΡΑΚΛΕΙΟΥΚΡΗΤΗΣ",
    "ΚΕΣΥ 1o Β ΘΕΣΣΑΛΟΝΙΚΗΣ",
    "ΚΕΣΥ 2o Β ΘΕΣΣΑΛΟΝΙΚΗΣ",
    "ΚΕΣΥ 2o ΠΕΙΡΑΙΑ",
    "ΠΕΙΡΑΙΑ",
    "ΚΕΣΥ 1o Β ΑΘΗΝΑΣ",
    "ΚΕΣΥ ΛΑΡΙΣΑΣ",
    "ΕΥΒΟΙΑΣ",
    "ΚΕΣΥ 2o Β ΑΘΗΝΑΣ",
    "ΚΕΣΥ 2o Α ΘΕΣΣΑΛΟΝΙΚΗΣ",
    "ΚΕΣΥ ΡΕΘΥΜΝΟΥ",
    "ΚΕΣΥ ΗΡΑΚΛΕΙΟΥ",
    "ΔΩΔΕΚΑΝΗΣΟΥ",
    "ΚΕΣΥ ΚΑΣΤΟΡΙΑΣ",
    "ΚΕΣΥ 1o Α ΘΕΣΣΑΛΟΝΙΚΗΣ",
    "ΣΑΜΟΥ",
    "ΚΕΣΥ 2o Α ΑΘΗΝΑΣ",
    "ΑΝΑΤΟΛΙΚΗΣ ΑΤΤΙΚΗΣ",
    "ΚΕΣΥ ΠΕΛΛΑΣ",
    "ΚΕΣΥ ΜΑΓΝΗΣΙΑΣ",
    "ΚΕΣΥ ΣΑΜΟΥ",
    "ΚΕΣΥ ΕΥΒΟΙΑΣ",
    "ΚΕΣΥ ΚΟΖΑΝΗΣ",
    "ΚΕΣΥ ΗΜΑΘΙΑΣ",
    "ΚΕΣΥ 1o ΑΧΑΪΑΣ",
    "ΚΕΣΥ ΘΕΣΠΡΩΤΙΑΣ",
    "ΚΕΣΥ 1o Γ ΑΘΗΝΑΣ",
    "ΚΕΣΥ ΞΑΝΘΗΣ",
    "ΚΕΣΥ ΦΛΩΡΙΝΑΣ",
    "ΚΕΣΥ ΡΟΔΟΥ",
    "ΕΒΡΟΥ",
    "ΚΕΣΥ 2o ΑΧΑΪΑΣ",
    "ΚΕΣΥ 2o ΑΝΑΤΟΛΙΚΗΣ ΑΤΤΙΚΗΣ",
    "ΚΕΣΥ 1o Δ ΑΘΗΝΑΣ",
    "ΚΕΣΥ ΣΕΡΡΩΝ",
    "ΚΕΣΥ ΝΑΞΟΥ",
    "ΚΕΣΥ ΦΘΙΩΤΙΔΑΣ",
    "ΚΕΣΥ 1o ΠΕΙΡΑΙΑ",
    "ΚΕΣΥ ΡΟΔΟΠΗΣ",
    "ΚΕΣΥ ΚΕΡΚΥΡΑΣ",
    "ΚΕΣΥ ΣΥΡΟΥ",
    "ΚΕΣΥ ΚΑΛΥΜΝΟΥ",
    "ΚΕΣΥ 1o Α ΑΘΗΝΑΣ",
    "ΚΕΡΚΥΡΑΣ",
    "ΚΕΣΥ 2o Δ ΑΘΗΝΑΣ",
    "ΚΕΣΥ ΒΟΙΩΤΙΑΣ",
    "ΚΕΣΥ 2o Γ ΑΘΗΝΑΣ",
    "ΚΕΣΥ ΔΥΤΙΚΗΣ ΑΤΤΙΚΗΣ",
    "ΚΕΣΥ ΦΩΚΙΔΑΣ",
    "ΚΕΣΥ 1o ΑΝΑΤΟΛΙΚΗΣ ΑΤΤΙΚΗΣ",
    "ΚΕΣΥ ΗΛΕΙΑΣ",
    "ΚΕΣΥ ΛΑΚΩΝΙΑΣ",
    "ΚΕΣΥ ΚΕΦΑΛΛΗΝΙΑΣ",
    "ΚΕΣΥ ΠΡΕΒΕΖΑΣ",
    "ΚΕΣΥ ΧΑΝΙΩΝ",
    "ΚΕΣΥ ΔΡΑΜΑΣ",
    "ΚΕΣΥ ΠΙΕΡΙΑΣ",
    "ΚΕΣΥ ΙΩΑΝΝΙΝΩΝ",
    "ΚΕΣΥ ΧΑΛΚΙΔΙΚΗΣ",
    "ΚΕΣΥ ΚΟΡΙΝΘΙΑΣ",
    "ΚΕΣΥ ΚΑΒΑΛΑΣ",
    "ΚΕΣΥ ΕΒΡΟΥ",
    "ΚΕΣΥ ΚΑΡΔΙΤΣΑΣ",
    "ΚΕΣΥ ΧΙΟΥ",
    "ΚΕΣΥ ΑΡΤΑΣ",
    "ΚΕΣΥ ΛΕΥΚΑΔΑΣ",
    "ΚΕΣΥ ΚΩ",
    "ΚΕΣΥ ΛΗΜΝΟΥ",
    "ΚΕΣΥ ΑΡΚΑΔΙΑΣ",
    "ΚΕΣΥ ΑΙΤΩΛΟΑΚΑΡΝΑΝΙΑΣ",
    "ΚΕΣΥ ΚΙΛΚΙΣ",
    "ΚΕΣΥ ΖΑΚΥΝΘΟΥ",
    "ΚΕΣΥ ΛΑΣΙΘΙΟΥ",
    "ΚΕΣΥ ΛΕΣΒΟΥ",
    "ΚΕΣΥ ΕΥΡΥΤΑΝΙΑΣ",
    "ΚΕΣΥ ΤΡΙΚΑΛΩΝ",
    "ΚΕΣΥ ΓΡΕΒΕΝΩΝ",
    "ΚΕΣΥ ΑΡΓΟΛΙΔΑΣ",
    "ΚΕΣΥ ΜΕΣΣΗΝΙΑΣ",
    "Κατάστημα Κράτησης Νέων Αυλώνα",
    "ΚΕΔΔΥ - ΠΕΙΡΑΙΑΣ",
    "ΚΕΔΔΥ - ΚΑΣΤΟΡΙΑ",
    "ΚΕΔΔΥ - ΚΕΡΚΥΡΑ",
    "ΚΕΔΔΥ - ΜΕΣΣΗΝΙΑ",
    "ΚΕΔΔΥ - ΛΑΚΩΝΙΑ",
    "ΚΕΔΔΥ - ΖΑΚΥΝΘΟΣ",
    "ΚΕΔΔΥ - ΚΟΖΑΝΗ",
    "ΚΕΔΔΥ - ΦΘΙΩΤΙΔΑ",
    "ΚΕΔΔΥ - Δ ΑΘΗΝΩΝ",
    "ΚΕΔΔΥ - ΒΟΙΩΤΙΑ",
    "ΚΕΔΔΥ - ΚΕΦΑΛΛΟΝΙΑ",
    "ΚΕΔΔΥ - ΑΡΚΑΔΙΑ",
    "Μουσικό Σχολείο Σερρών",
    "Μουσικό Σχολείο Αργολίδας",
    "Μουσικό Σχολείο Θέρισου",
    "Μουσικό Σχολείο Ρεθύμνου",
    "Μουσικό Σχολείο Ρόδου",
    "Μουσικό Σχολείο Βέροιας",
    "Μουσικό Σχολείο Κομοτηνής",
    "Μουσικό Σχολείο Καλαμάτας",
    "Μουσικό Σχολείο Καβάλας",
    "Μουσικό Σχολείο Δράμας",
    "Μουσικό Σχολείο Αθηνών",
    "Μουσικό Σχολείο Κατερίνης",
    "Μουσικό Σχολείο Αμφισσας",
    "Μουσικό Σχολείο Αμύνταιου",
    "Μουσικό Σχολείο Ιωαννίνων",
    "Μουσικό Σχολείο Αρτας",
    "Αιτωλ/νίας",
    "ΚΕΔΔΥ - ΚΩΣ",
    "Μουσικό Σχολείο Κορίνθου",
    "Μουσικό Σχολείο Βόλου",
    "Μουσικό Σχολείο Καρδίτσας",
    "Μουσικό Σχολείο Θεσσαλονίκης",
    "Α Αθηνών",
    "Λευκάδα",
    "Β Αθηνών",
    "Γ Αθηνών",
    "Λασίθι",
    "Ηλεία",
    "Εύβοια",
    "Μεσσηνία",
    "Α Κεφαλλονιά",
    "Λακωνία",
    "Βοιωτία",
    "Αργολίδα",
    "Δ Αθηνών",
    "Φθιώτιδα",
    "Ηράκλειο",
    "Ρέθυμνο",
    "Κέρκυρα",
    "Αχαΐα",
    "Κορινθία",
    "Αρκαδία",
    "Εβρος",
    "Ροδόπη",
    "Σέρρες",
    "Καβάλας",
    "Κοζάνη",
    "Κατάστημα Κράτησης Κορίνθου [ΠΑΡΑΡΤΗΜΑ ΕΣΠΕΡΙΝΟΥ ΓΥΜΝΑΣΙΟΥ ΚΟΡΙΝΘΟΥ ΚΑΙ ΠΑΡΑΡΤΗΜΑ 1ου ΓΕΛ ΚΟΡΙΝΘΟΥ (Κ.Κ.Κ.)]",
    "Ειδικό Αγροτικό Κατάστημα Κράτησης Νέων Κασσαβέτειας [ΠΑΡΑΡΤΗΜΑ ΓΥΜΝΑΣΙΟΥ Ν. ΑΓΧΙΑΛΟΥ (Ε.Α.Κ.Κ.Ν.Κ.)]",
    "ΚΑΛΛΙΤΕΧΝΙΚΟ ΓΥΜΝΑΣΙΟ ΜΕΣΟΛΟΓΓΙΟΥ",
    "ΡΟΔΟΠΗΣ – Μειονοτικά - ελληνόγλωσσο πρόγραμμα",
    "Κατάστημα Κράτησης Κορίνθου",
    "ΚΑΛΛΙΤΕΧΝΙΚΟ ΓΥΜΝΑΣΙΟ ΑΘΗΝΑΣ",
    "ΞΑΝΘΗΣ– Μειονοτικά - ελληνόγλωσσο πρόγραμμα",
    "ΚΑ-ΡΙΑΣ",
    "ΚΕΔΑΣΥ 1o ΠΕΙΡΑΙΑ",
    "ΚΕΔΑΣΥ 1o Β ΑΘΗΝΑΣ",
    "ΚΕΔΑΣΥ 2o Β ΑΘΗΝΑΣ",
    "ΚΕΔΑΣΥ 1o Α ΑΘΗΝΑΣ",
    "ΚΕΔΑΣΥ 2o Α ΘΕΣΣΑΛΟΝΙΚΗΣ",
    "ΚΕΔΑΣΥ 1o Α ΘΕΣΣΑΛΟΝΙΚΗΣ",
    "ΚΕΔΑΣΥ ΘΕΣΠΡΩΤΙΑΣ",
    "ΚΕΔΑΣΥ ΣΕΡΡΩΝ",
    "ΚΕΔΑΣΥ ΣΑΜΟΥ",
    "ΚΕΔΑΣΥ 1o Δ ΑΘΗΝΑΣ",
    "ΚΕΔΑΣΥ ΗΡΑΚΛΕΙΟΥ",
    "ΚΕΔΑΣΥ ΚΑΡΔΙΤΣΑΣ",
    "ΚΕΔΑΣΥ ΙΩΑΝΝΙΝΩΝ",
    "ΚΕΔΑΣΥ 2o ΑΧΑΪΑΣ",
    "ΚΕΔΑΣΥ ΡΟΔΟΥ",
    "ΚΕΔΑΣΥ 2o Γ ΑΘΗΝΑΣ",
    "ΚΕΔΑΣΥ 2o ΑΝΑΤΟΛΙΚΗΣ ΑΤΤΙΚΗΣ",
    "ΚΕΔΑΣΥ ΜΑΓΝΗΣΙΑΣ",
    "ΚΕΔΑΣΥ ΛΕΣΒΟΥ",
    "ΚΕΔΑΣΥ ΗΜΑΘΙΑΣ",
    "ΚΕΔΑΣΥ 1o ΑΧΑΪΑΣ",
    "ΚΕΔΑΣΥ ΛΑΡΙΣΑΣ",
    "ΚΕΔΑΣΥ ΕΥΒΟΙΑΣ",
    "ΚΕΔΑΣΥ 1o Γ ΑΘΗΝΑΣ",
    "ΚΕΔΑΣΥ 1o Β ΘΕΣΣΑΛΟΝΙΚΗΣ",
    "ΚΕΔΑΣΥ ΧΑΛΚΙΔΙΚΗΣ",
    "ΚΕΔΑΣΥ ΑΙΤΩΛΟΑΚΑΡΝΑΝΙΑΣ",
    "ΚΕΔΑΣΥ ΚΙΛΚΙΣ",
    "ΚΕΔΑΣΥ ΠΕΛΛΑΣ",
    "ΚΕΔΑΣΥ ΞΑΝΘΗΣ",
    "ΚΕΔΑΣΥ ΚΑ-ΡΙΑΣ",
    "ΚΕΔΑΣΥ ΠΡΕΒΕΖΑΣ",
    "ΚΕΔΑΣΥ ΣΥΡΟΥ",
    "ΚΕΔΑΣΥ 2o Δ ΑΘΗΝΑΣ",
    "ΚΕΔΑΣΥ ΤΡΙΚΑΛΩΝ",
    "ΚΕΔΑΣΥ ΜΕΣΣΗΝΙΑΣ",
    "ΚΕΔΑΣΥ ΦΛΩΡΙΝΑΣ",
    "ΚΕΔΑΣΥ ΗΛΕΙΑΣ",
    "ΚΕΔΑΣΥ ΡΟΔΟΠΗΣ",
    "ΚΕΔΑΣΥ ΛΕΥΚΑΔΑΣ",
    "ΚΕΔΑΣΥ 2o Α ΑΘΗΝΑΣ",
    "ΚΕΔΑΣΥ 1o ΑΝΑΤΟΛΙΚΗΣ ΑΤΤΙΚΗΣ",
    "ΚΕΔΑΣΥ ΚΕΡΚΥΡΑΣ",
    "ΚΕΔΑΣΥ 2o ΠΕΙΡΑΙΑ",
    "ΚΕΔΑΣΥ ΔΥΤΙΚΗΣ ΑΤΤΙΚΗΣ",
    "ΚΕΔΑΣΥ ΕΥΡΥΤΑΝΙΑΣ",
    "ΚΕΔΑΣΥ ΚΩ",
    "ΚΕΔΑΣΥ ΒΟΙΩΤΙΑΣ",
    "ΚΕΔΑΣΥ ΡΕΘΥΜΝΟΥ",
    "ΚΕΔΑΣΥ ΑΡΚΑΔΙΑΣ",
    "ΚΕΔΑΣΥ ΧΙΟΥ",
    "ΚΕΔΑΣΥ ΦΩΚΙΔΑΣ",
    "ΚΕΔΑΣΥ ΝΑΞΟΥ",
    "ΚΕΔΑΣΥ ΛΗΜΝΟΥ",
    "ΚΕΔΑΣΥ ΦΘΙΩΤΙΔΑΣ",
    "ΚΕΔΑΣΥ ΖΑΚΥΝΘΟΥ",
    "ΚΕΔΑΣΥ ΚΑΛΥΜΝΟΥ",
    "ΣΔΕΥ - ΚΕΔΑΣΥ 2o Α ΘΕΣΣΑΛΟΝΙΚΗΣ",
    "ΣΔΕΥ - ΚΕΔΑΣΥ 1o Α ΘΕΣΣΑΛΟΝΙΚΗΣ",
    "ΣΔΕΥ - ΚΕΔΑΣΥ ΗΡΑΚΛΕΙΟΥ",
    "ΚΕΔΑΣΥ 2o Β ΘΕΣΣΑΛΟΝΙΚΗΣ",
    "ΣΔΕΥ - ΚΕΔΑΣΥ 2o Β ΑΘΗΝΑΣ",
    "ΣΔΕΥ - ΚΕΔΑΣΥ ΔΡΑΜΑΣ",
    "ΣΔΕΥ - ΚΕΔΑΣΥ ΚΑΒΑΛΑΣ",
    "ΣΔΕΥ - ΚΕΔΑΣΥ ΧΙΟΥ",
    "ΣΔΕΥ - ΚΕΔΑΣΥ ΡΕΘΥΜΝΟΥ",
    "ΣΔΕΥ - ΚΕΔΑΣΥ ΕΒΡΟΥ",
    "ΣΔΕΥ - ΚΕΔΑΣΥ ΑΙΤΩΛΟΑΚΑΡΝΑΝΙΑΣ",
    "ΚΕΔΑΣΥ ΛΑΣΙΘΙΟΥ",
    "ΣΔΕΥ - ΚΕΔΑΣΥ 1o Δ ΑΘΗΝΑΣ",
    "ΣΔΕΥ - ΚΕΔΑΣΥ 2o Β ΘΕΣΣΑΛΟΝΙΚΗΣ",
    "ΣΔΕΥ - ΚΕΔΑΣΥ ΜΕΣΣΗΝΙΑΣ",
    "ΣΔΕΥ - ΚΕΔΑΣΥ ΜΑΓΝΗΣΙΑΣ",
    "ΣΔΕΥ - ΚΕΔΑΣΥ 2o Α ΑΘΗΝΑΣ",
    "ΣΔΕΥ - ΚΕΔΑΣΥ ΑΡΓΟΛΙΔΑΣ",
    "ΣΔΕΥ - ΚΕΔΑΣΥ ΓΡΕΒΕΝΩΝ",
    "ΣΔΕΥ - ΚΕΔΑΣΥ 1o Β ΑΘΗΝΑΣ",
    "ΣΔΕΥ - ΚΕΔΑΣΥ ΤΡΙΚΑΛΩΝ",
    "ΣΔΕΥ - ΚΕΔΑΣΥ ΣΕΡΡΩΝ",
    "ΚΕΔΑΣΥ ΧΑΝΙΩΝ",
    "ΣΔΕΥ - ΚΕΔΑΣΥ ΡΟΔΟΥ",
    "ΣΔΕΥ - ΚΕΔΑΣΥ 2o ΠΕΙΡΑΙΑ",
    "ΣΔΕΥ - ΚΕΔΑΣΥ ΚΟΖΑΝΗΣ",
    "ΣΔΕΥ - ΚΕΔΑΣΥ ΙΩΑΝΝΙΝΩΝ",
    "ΣΔΕΥ - ΚΕΔΑΣΥ 1o Α ΑΘΗΝΑΣ",
    "ΣΔΕΥ - ΚΕΔΑΣΥ 1o ΠΕΙΡΑΙΑ",
    "ΣΔΕΥ - ΚΕΔΑΣΥ ΦΩΚΙΔΑΣ",
    "ΣΔΕΥ - ΚΕΔΑΣΥ ΠΙΕΡΙΑΣ",
    "ΣΔΕΥ - ΚΕΔΑΣΥ 2o ΑΝΑΤΟΛΙΚΗΣ ΑΤΤΙΚΗΣ",
    "ΣΔΕΥ - ΚΕΔΑΣΥ ΑΡΚΑΔΙΑΣ",
    "ΣΔΕΥ - ΚΕΔΑΣΥ 1o Β ΘΕΣΣΑΛΟΝΙΚΗΣ",
    "ΣΔΕΥ - ΚΕΔΑΣΥ 1o ΑΝΑΤΟΛΙΚΗΣ ΑΤΤΙΚΗΣ",
    "ΣΔΕΥ - ΚΕΔΑΣΥ 2o Δ ΑΘΗΝΑΣ",
    "ΣΔΕΥ - ΚΕΔΑΣΥ ΒΟΙΩΤΙΑΣ",
    "ΚΕΔΑΣΥ ΔΡΑΜΑΣ",
    "ΣΔΕΥ - ΚΕΔΑΣΥ ΚΟΡΙΝΘΙΑΣ",
    "ΚΕΔΑΣΥ ΑΡΤΑΣ",
    "ΚΕΔΑΣΥ ΚΟΡΙΝΘΙΑΣ",
    "ΣΔΕΥ - ΚΕΔΑΣΥ 2o Γ ΑΘΗΝΑΣ",
    "ΣΔΕΥ - ΚΕΔΑΣΥ ΚΑ-ΡΙΑΣ",
    "ΣΔΕΥ - ΚΕΔΑΣΥ ΗΜΑΘΙΑΣ",
    "ΣΔΕΥ - ΚΕΔΑΣΥ ΚΙΛΚΙΣ",
    "ΣΔΕΥ - ΚΕΔΑΣΥ ΧΑΝΙΩΝ",
    "ΣΔΕΥ - ΚΕΔΑΣΥ ΛΑΚΩΝΙΑΣ",
    "ΣΔΕΥ - ΚΕΔΑΣΥ 1o Γ ΑΘΗΝΑΣ",
    "ΣΔΕΥ - ΚΕΔΑΣΥ ΕΥΒΟΙΑΣ",
    "ΣΔΕΥ - ΚΕΔΑΣΥ ΚΑΛΥΜΝΟΥ",
    "ΚΕΔΑΣΥ ΑΡΓΟΛΙΔΑΣ",
    "ΣΔΕΥ - ΚΕΔΑΣΥ ΛΕΥΚΑΔΑΣ",
    "ΣΔΕΥ - ΚΕΔΑΣΥ ΗΛΕΙΑΣ",
    "ΣΔΕΥ - ΚΕΔΑΣΥ ΔΥΤΙΚΗΣ ΑΤΤΙΚΗΣ",
    "ΣΔΕΥ - ΚΕΔΑΣΥ ΛΑΡΙΣΑΣ",
    "ΣΔΕΥ - ΚΕΔΑΣΥ 2o ΑΧΑΪΑΣ",
    "ΣΔΕΥ - ΚΕΔΑΣΥ ΣΑΜΟΥ",
    "ΚΕΔΑΣΥ ΚΕΦΑΛΛΗΝΙΑΣ",
    "ΣΔΕΥ - ΚΕΔΑΣΥ ΠΡΕΒΕΖΑΣ",
    "ΚΕΔΑΣΥ ΕΒΡΟΥ",
    "ΣΔΕΥ - ΚΕΔΑΣΥ ΞΑΝΘΗΣ",
    "ΚΕΔΑΣΥ ΠΙΕΡΙΑΣ",
    "ΣΔΕΥ - ΚΕΔΑΣΥ 1o ΑΧΑΪΑΣ",
    "ΣΔΕΥ - ΚΕΔΑΣΥ ΧΑΛΚΙΔΙΚΗΣ",
    "ΣΔΕΥ - ΚΕΔΑΣΥ ΚΑΡΔΙΤΣΑΣ",
    "ΚΕΔΑΣΥ ΚΑΒΑΛΑΣ",
    "ΣΔΕΥ - ΚΕΔΑΣΥ ΠΕΛΛΑΣ",
    "ΣΔΕΥ - ΚΕΔΑΣΥ ΝΑΞΟΥ",
    "ΚΕΔΑΣΥ ΛΑΚΩΝΙΑΣ",
    "ΣΔΕΥ - ΚΕΔΑΣΥ ΚΩ",
    "ΚΕΔΑΣΥ ΚΟΖΑΝΗΣ",
    "ΣΔΕΥ - ΚΕΔΑΣΥ ΦΘΙΩΤΙΔΑΣ",
    "ΣΔΕΥ - ΚΕΔΑΣΥ ΛΑΣΙΘΙΟΥ",
    "ΣΔΕΥ - ΚΕΔΑΣΥ ΖΑΚΥΝΘΟΥ",
    "ΣΔΕΥ - ΚΕΔΑΣΥ ΡΟΔΟΠΗΣ",
    "ΣΔΕΥ - ΚΕΔΑΣΥ ΛΕΣΒΟΥ",
    "ΣΔΕΥ - ΚΕΔΑΣΥ ΚΕΦΑΛΛΗΝΙΑΣ",
    "ΣΔΕΥ - ΚΕΔΑΣΥ ΛΗΜΝΟΥ",
    "ΣΔΕΥ - ΚΕΔΑΣΥ ΚΕΡΚΥΡΑΣ",
    "ΣΔΕΥ - ΚΕΔΑΣΥ ΘΕΣΠΡΩΤΙΑΣ",
    "ΣΔΕΥ - ΚΕΔΑΣΥ ΑΡΤΑΣ",
    "ΣΔΕΥ - ΚΕΔΑΣΥ ΦΛΩΡΙΝΑΣ",
    "ΣΔΕΥ - ΚΕΔΑΣΥ ΣΥΡΟΥ",
    "ΣΔΕΥ - ΚΕΔΑΣΥ ΕΥΡΥΤΑΝΙΑΣ",
    "Μουσικό Σχολείο Πτολεμαΐδας",
    "Μουσικό Σχολείο Σιάτιστας",
    "Μουσικό Σχολείο Παλλήνης",
    "Μουσικό Σχολείο Λιβαδειάς",
    "Μουσικό Σχολείο Ίλιου",
    "Μουσικό Σχολείο Τρικάλων",
    "Μουσικό Σχολείο Μυτιλήνης",
    "Μουσικό Σχολείο Λαμίας",
    "Μουσικό Σχολείο Καστοριάς",
    "Μουσικό Σχολείο Χαλκίδας",
    "Μουσικό Σχολείο Τριπόλεως",
    "Μουσικό Σχολείο Σάμου",
    "Μουσικό Σχολείο Κέρκυρας",
    "Μουσικό Σχολείο Λάρισας",
    "Μουσικό Σχολείο Αλεξανδρούπολης",
    "Μουσικό Σχολείο Λευκάδας",
    "ΚΕΔΑΣΥ ΓΡΕΒΕΝΩΝ",
    "ΚΕΔΑΣΥ ΚΑΣΤΟΡΙΑΣ",
    "Ειδικό Κατάστημα Κράτησης Νέων Αυλώνα [2ο ΓΥΜΝΑΣΙΟ ΑΥΛΩΝΑ ΜΕ ΛΥΚΕΙΑΚΕΣ ΤΑΞΕΙΣ (Ε.Κ.Κ.Ν.Α.)]",
    "Ειδικό Κατάστημα Κράτησης Νέων Βόλου [ΠΑΡΑΡΤΗΜΑ 6ου ΓΥΜΝΑΣΙΟΥ ΒΟΛΟΥ (Ε.Κ.Κ.Ν.Β.)]",
    "ΚΑΛΛΙΤΕΧΝΙΚΟ ΓΥΜΝΑΣΙΟ ΑΡΓΟΛΙΔΑΣ",
    "ΣΔΕΥ στο ΚΕΔΑΣΥ ΜΑΓΝΗΣΙΑΣ",
    "ΣΔΕΥ στο ΚΕΔΑΣΥ ΗΡΑΚΛΕΙΟΥ",
    "ΣΔΕΥ στο ΚΕΔΑΣΥ 1o Α ΘΕΣΣΑΛΟΝΙΚΗΣ",
    "ΣΔΕΥ στο ΚΕΔΑΣΥ 2o Α ΘΕΣΣΑΛΟΝΙΚΗΣ",
    "ΣΔΕΥ στο ΚΕΔΑΣΥ ΛΕΣΒΟΥ",
    "ΣΔΕΥ στο ΚΕΔΑΣΥ ΧΙΟΥ",
    "ΣΔΕΥ στο ΚΕΔΑΣΥ ΚΟΡΙΝΘΙΑΣ",
    "ΣΔΕΥ στο ΚΕΔΑΣΥ ΛΕΥΚΑΔΑΣ",
    "ΣΔΕΥ στο ΚΕΔΑΣΥ ΑΡΓΟΛΙΔΑΣ",
    "ΣΔΕΥ στο ΚΕΔΑΣΥ ΗΛΕΙΑΣ",
    "ΣΔΕΥ στο ΚΕΔΑΣΥ 2o ΑΧΑΪΑΣ",
    "ΣΔΕΥ στο ΚΕΔΑΣΥ 1o Β ΘΕΣΣΑΛΟΝΙΚΗΣ",
    "ΣΔΕΥ στο ΚΕΔΑΣΥ ΧΑΝΙΩΝ",
    "ΣΔΕΥ στο ΚΕΔΑΣΥ ΜΕΣΣΗΝΙΑΣ",
    "ΣΔΕΥ στο ΚΕΔΑΣΥ 1o Γ ΑΘΗΝΑΣ",
    "ΣΔΕΥ στο ΚΕΔΑΣΥ ΛΑΡΙΣΑΣ",
    "ΣΔΕΥ στο ΚΕΔΑΣΥ ΙΩΑΝΝΙΝΩΝ",
    "ΣΔΕΥ στο ΚΕΔΑΣΥ ΠΙΕΡΙΑΣ",
    "ΣΔΕΥ στο ΚΕΔΑΣΥ ΕΒΡΟΥ",
    "ΣΔΕΥ στο ΚΕΔΑΣΥ ΦΩΚΙΔΑΣ",
    "ΣΔΕΥ στο ΚΕΔΑΣΥ ΚΑΡΔΙΤΣΑΣ",
    "ΣΔΕΥ στο ΚΕΔΑΣΥ 2o ΑΝΑΤΟΛΙΚΗΣ ΑΤΤΙΚΗΣ",
    "ΣΔΕΥ στο ΚΕΔΑΣΥ ΕΥΒΟΙΑΣ",
    "ΣΔΕΥ στο ΚΕΔΑΣΥ 1o Α ΑΘΗΝΑΣ",
    "ΣΔΕΥ στο ΚΕΔΑΣΥ ΚΟΖΑΝΗΣ",
    "ΣΔΕΥ στο ΚΕΔΑΣΥ ΡΟΔΟΥ",
    "ΣΔΕΥ στο ΚΕΔΑΣΥ ΒΟΙΩΤΙΑΣ",
    "ΣΔΕΥ στο ΚΕΔΑΣΥ 2o Β ΘΕΣΣΑΛΟΝΙΚΗΣ",
    "ΣΔΕΥ στο ΚΕΔΑΣΥ 2o Δ ΑΘΗΝΑΣ",
    "ΣΔΕΥ στο ΚΕΔΑΣΥ 2o Β ΑΘΗΝΑΣ",
    "ΣΔΕΥ στο ΚΕΔΑΣΥ ΚΑΣΤΟΡΙΑΣ",
    "ΣΔΕΥ στο ΚΕΔΑΣΥ 1o Δ ΑΘΗΝΑΣ",
    "ΣΔΕΥ στο ΚΕΔΑΣΥ 1o ΑΝΑΤΟΛΙΚΗΣ ΑΤΤΙΚΗΣ",
    "ΣΔΕΥ στο ΚΕΔΑΣΥ 1o Β ΑΘΗΝΑΣ",
    "ΣΔΕΥ στο ΚΕΔΑΣΥ 2o Γ ΑΘΗΝΑΣ",
    "ΣΔΕΥ στο ΚΕΔΑΣΥ 2o Α ΑΘΗΝΑΣ",
    "ΣΔΕΥ στο ΚΕΔΑΣΥ ΣΥΡΟΥ",
    "ΣΔΕΥ στο ΚΕΔΑΣΥ ΚΑΒΑΛΑΣ",
    "ΣΔΕΥ στο ΚΕΔΑΣΥ ΑΙΤΩΛΟΑΚΑΡΝΑΝΙΑΣ",
    "ΣΔΕΥ στο ΚΕΔΑΣΥ ΚΕΦΑΛΛΗΝΙΑΣ",
    "ΣΔΕΥ στο ΚΕΔΑΣΥ 1o ΑΧΑΪΑΣ",
    "ΣΔΕΥ στο ΚΕΔΑΣΥ ΔΥΤΙΚΗΣ ΑΤΤΙΚΗΣ",
    "ΣΔΕΥ στο ΚΕΔΑΣΥ ΘΕΣΠΡΩΤΙΑΣ",
    "ΣΔΕΥ στο ΚΕΔΑΣΥ ΣΕΡΡΩΝ",
    "ΣΔΕΥ στο ΚΕΔΑΣΥ 1o ΠΕΙΡΑΙΑ",
    "ΣΔΕΥ στο ΚΕΔΑΣΥ ΡΕΘΥΜΝΟΥ",
    "ΣΔΕΥ στο ΚΕΔΑΣΥ ΛΑΣΙΘΙΟΥ",
    "ΣΔΕΥ στο ΚΕΔΑΣΥ ΑΡΚΑΔΙΑΣ",
    "ΣΔΕΥ στο ΚΕΔΑΣΥ ΔΡΑΜΑΣ",
    "ΣΔΕΥ στο ΚΕΔΑΣΥ ΧΑΛΚΙΔΙΚΗΣ",
    "ΣΔΕΥ στο ΚΕΔΑΣΥ ΦΘΙΩΤΙΔΑΣ",
    "ΣΔΕΥ στο ΚΕΔΑΣΥ ΗΜΑΘΙΑΣ",
    "ΣΔΕΥ στο ΚΕΔΑΣΥ ΠΕΛΛΑΣ",
    "ΣΔΕΥ στο ΚΕΔΑΣΥ ΤΡΙΚΑΛΩΝ",
    "ΣΔΕΥ στο ΚΕΔΑΣΥ ΛΑΚΩΝΙΑΣ",
    "ΣΔΕΥ στο ΚΕΔΑΣΥ ΚΙΛΚΙΣ",
    "ΣΔΕΥ στο ΚΕΔΑΣΥ 2o ΠΕΙΡΑΙΑ",
    "ΣΔΕΥ στο ΚΕΔΑΣΥ ΞΑΝΘΗΣ",
    "ΣΔΕΥ στο ΚΕΔΑΣΥ ΡΟΔΟΠΗΣ",
    "ΣΔΕΥ στο ΚΕΔΑΣΥ ΚΕΡΚΥΡΑΣ",
    "ΣΔΕΥ στο ΚΕΔΑΣΥ ΛΗΜΝΟΥ",
    "ΣΔΕΥ στο ΚΕΔΑΣΥ ΚΩ",
    "ΣΔΕΥ στο ΚΕΔΑΣΥ ΖΑΚΥΝΘΟΥ",
    "ΣΔΕΥ στο ΚΕΔΑΣΥ ΑΡΤΑΣ",
    "ΣΔΕΥ στο ΚΕΔΑΣΥ ΦΛΩΡΙΝΑΣ",
    "ΣΔΕΥ στο ΚΕΔΑΣΥ ΓΡΕΒΕΝΩΝ",
    "ΣΔΕΥ στο ΚΕΔΑΣΥ ΣΑΜΟΥ",
    "ΣΔΕΥ στο ΚΕΔΑΣΥ ΚΑΛΥΜΝΟΥ",
    "ΣΔΕΥ στο ΚΕΔΑΣΥ ΝΑΞΟΥ",
    "ΣΔΕΥ στο ΚΕΔΑΣΥ ΠΡΕΒΕΖΑΣ",
    "ΣΔΕΥ στο ΚΕΔΑΣΥ ΕΥΡΥΤΑΝΙΑΣ",
    "Μουσικό Σχολείο Σπάρτης",
    "Μουσικό Γυμνάσιο Παλλήνης",
    "Μουσικό Σχολείο Ηγουμενίτσας",
    "Μουσικό Σχολείο Βαρθολομιού"
]
`
const req7 = `
Παραδειγμα αιτήματος
http://localhost:5173/dieythynsh
`
const resp7 = `
Παραδειγμα απάντησης
[
    "ΔΕ Α ΑΘΗΝΑΣ",
    "ΔΕ Α ΘΕΣΣΑΛΟΝΙΚΗΣ",
    "ΔΕ ΑΙΤΩΛΟΑΚΑΡΝΑΝΙΑΣ",
    "ΔΕ ΑΝΑΤΟΛΙΚΗΣ ΑΤΤΙΚΗΣ",
    "ΔΕ ΑΡΓΟΛΙΔΑΣ",
    "ΔΕ ΑΡΚΑΔΙΑΣ",
    "ΔΕ ΑΡΤΑΣ",
    "ΔΕ ΑΧΑΪΑΣ",
    "ΔΕ Β ΑΘΗΝΑΣ",
    "ΔΕ Β ΘΕΣΣΑΛΟΝΙΚΗΣ",
    "ΔΕ ΒΟΙΩΤΙΑΣ",
    "ΔΕ Γ ΑΘΗΝΑΣ",
    "ΔΕ ΓΡΕΒΕΝΩΝ",
    "ΔΕ Δ ΑΘΗΝΑΣ",
    "ΔΕ ΔΡΑΜΑΣ",
    "ΔΕ ΔΥΤΙΚΗΣ ΑΤΤΙΚΗΣ",
    "ΔΕ ΔΩΔΕΚΑΝΗΣΟΥ",
    "ΔΕ ΕΒΡΟΥ",
    "ΔΕ ΕΥΒΟΙΑΣ",
    "ΔΕ ΕΥΡΥΤΑΝΙΑΣ",
    "ΔΕ ΖΑΚΥΝΘΟΥ",
    "ΔΕ ΗΛΕΙΑΣ",
    "ΔΕ ΗΜΑΘΙΑΣ",
    "ΔΕ ΗΡΑΚΛΕΙΟΥ",
    "ΔΕ ΘΕΣΠΡΩΤΙΑΣ",
    "ΔΕ ΙΩΑΝΝΙΝΩΝ",
    "ΔΕ ΚΑΒΑΛΑΣ",
    "ΔΕ ΚΑΡΔΙΤΣΑΣ",
    "ΔΕ ΚΑΣΤΟΡΙΑΣ",
    "ΔΕ ΚΕΡΚΥΡΑΣ",
    "ΔΕ ΚΕΦΑΛΛΗΝΙΑΣ",
    "ΔΕ ΚΙΛΚΙΣ",
    "ΔΕ ΚΟΖΑΝΗΣ",
    "ΔΕ ΚΟΡΙΝΘΙΑΣ",
    "ΔΕ ΚΥΚΛΑΔΩΝ",
    "ΔΕ ΛΑΚΩΝΙΑΣ",
    "ΔΕ ΛΑΡΙΣΑΣ",
    "ΔΕ ΛΑΣΙΘΙΟΥ",
    "ΔΕ ΛΕΣΒΟΥ",
    "ΔΕ ΛΕΥΚΑΔΑΣ",
    "ΔΕ ΜΑΓΝΗΣΙΑΣ",
    "ΔΕ ΜΕΣΣΗΝΙΑΣ",
    "ΔΕ ΞΑΝΘΗΣ",
    "ΔΕ ΠΕΙΡΑΙΑ",
    "ΔΕ ΠΕΛΛΑΣ",
    "ΔΕ ΠΙΕΡΙΑΣ",
    "ΔΕ ΠΡΕΒΕΖΑΣ",
    "ΔΕ ΡΕΘΥΜΝΟΥ",
    "ΔΕ ΡΟΔΟΠΗΣ",
    "ΔΕ ΣΑΜΟΥ",
    "ΔΕ ΣΕΡΡΩΝ",
    "ΔΕ ΤΡΙΚΑΛΩΝ",
    "ΔΕ ΦΘΙΩΤΙΔΑΣ",
    "ΔΕ ΦΛΩΡΙΝΑΣ",
    "ΔΕ ΦΩΚΙΔΑΣ",
    "ΔΕ ΧΑΛΚΙΔΙΚΗΣ",
    "ΔΕ ΧΑΝΙΩΝ",
    "ΔΕ ΧΙΟΥ",
    "ΠΕ Α ΑΘΗΝΑΣ",
    "ΠΕ Α ΘΕΣΣΑΛΟΝΙΚΗΣ",
    "ΠΕ ΑΙΤΩΛΟΑΚΑΡΝΑΝΙΑΣ",
    "ΠΕ ΑΝΑΤΟΛΙΚΗΣ ΑΤΤΙΚΗΣ",
    "ΠΕ ΑΡΓΟΛΙΔΑΣ",
    "ΠΕ ΑΡΚΑΔΙΑΣ",
    "ΠΕ ΑΡΤΑΣ",
    "ΠΕ ΑΧΑΪΑΣ",
    "ΠΕ Β ΑΘΗΝΑΣ",
    "ΠΕ Β ΘΕΣΣΑΛΟΝΙΚΗΣ",
    "ΠΕ ΒΟΙΩΤΙΑΣ",
    "ΠΕ Γ ΑΘΗΝΑΣ",
    "ΠΕ ΓΡΕΒΕΝΩΝ",
    "ΠΕ Δ ΑΘΗΝΑΣ",
    "ΠΕ ΔΡΑΜΑΣ",
    "ΠΕ ΔΥΤΙΚΗΣ ΑΤΤΙΚΗΣ",
    "ΠΕ ΔΩΔΕΚΑΝΗΣΟΥ",
    "ΠΕ ΕΒΡΟΥ",
    "ΠΕ ΕΥΒΟΙΑΣ",
    "ΠΕ ΕΥΡΥΤΑΝΙΑΣ",
    "ΠΕ ΖΑΚΥΝΘΟΥ",
    "ΠΕ ΗΛΕΙΑΣ",
    "ΠΕ ΗΜΑΘΙΑΣ",
    "ΠΕ ΗΡΑΚΛΕΙΟΥ",
    "ΠΕ ΘΕΣΠΡΩΤΙΑΣ",
    "ΠΕ ΙΩΑΝΝΙΝΩΝ",
    "ΠΕ ΚΑΒΑΛΑΣ",
    "ΠΕ ΚΑΡΔΙΤΣΑΣ",
    "ΠΕ ΚΑΣΤΟΡΙΑΣ",
    "ΠΕ ΚΕΡΚΥΡΑΣ",
    "ΠΕ ΚΕΦΑΛΛΗΝΙΑΣ",
    "ΠΕ ΚΙΛΚΙΣ",
    "ΠΕ ΚΟΖΑΝΗΣ",
    "ΠΕ ΚΟΡΙΝΘΙΑΣ",
    "ΠΕ ΚΥΚΛΑΔΩΝ",
    "ΠΕ ΛΑΚΩΝΙΑΣ",
    "ΠΕ ΛΑΡΙΣΑΣ",
    "ΠΕ ΛΑΣΙΘΙΟΥ",
    "ΠΕ ΛΕΣΒΟΥ",
    "ΠΕ ΛΕΥΚΑΔΑΣ",
    "ΠΕ ΜΑΓΝΗΣΙΑΣ",
    "ΠΕ ΜΕΣΣΗΝΙΑΣ",
    "ΠΕ ΞΑΝΘΗΣ",
    "ΠΕ ΠΕΙΡΑΙΑ",
    "ΠΕ ΠΕΛΛΑΣ",
    "ΠΕ ΠΙΕΡΙΑΣ",
    "ΠΕ ΠΡΕΒΕΖΑΣ",
    "ΠΕ ΡΕΘΥΜΝΟΥ",
    "ΠΕ ΡΟΔΟΠΗΣ",
    "ΠΕ ΣΑΜΟΥ",
    "ΠΕ ΣΕΡΡΩΝ",
    "ΠΕ ΤΡΙΚΑΛΩΝ",
    "ΠΕ ΦΘΙΩΤΙΔΑΣ",
    "ΠΕ ΦΛΩΡΙΝΑΣ",
    "ΠΕ ΦΩΚΙΔΑΣ",
    "ΠΕ ΧΑΛΚΙΔΙΚΗΣ",
    "ΠΕ ΧΑΝΙΩΝ",
    "ΠΕ ΧΙΟΥ",
    "ΠΕΡΙΦΕΡΕΙΑΚΗ ΔΙΕΥΘΥΝΣΗ ΑΝΑΤΟΛΙΚΗΣ ΜΑΚΕΔΟΝΙΑΣ ΚΑΙ ΘΡΑΚΗΣ",
    "ΠΕΡΙΦΕΡΕΙΑΚΗ ΔΙΕΥΘΥΝΣΗ ΑΤΤΙΚΗΣ",
    "ΠΕΡΙΦΕΡΕΙΑΚΗ ΔΙΕΥΘΥΝΣΗ ΒΟΡΕΙΟΥ ΑΙΓΑΙΟΥ",
    "ΠΕΡΙΦΕΡΕΙΑΚΗ ΔΙΕΥΘΥΝΣΗ ΔΥΤΙΚΗΣ ΕΛΛΑΔΑΣ",
    "ΠΕΡΙΦΕΡΕΙΑΚΗ ΔΙΕΥΘΥΝΣΗ ΔΥΤΙΚΗΣ ΜΑΚΕΔΟΝΙΑΣ",
    "ΠΕΡΙΦΕΡΕΙΑΚΗ ΔΙΕΥΘΥΝΣΗ ΗΠΕΙΡΟΥ",
    "ΠΕΡΙΦΕΡΕΙΑΚΗ ΔΙΕΥΘΥΝΣΗ ΘΕΣΣΑΛΙΑΣ",
    "ΠΕΡΙΦΕΡΕΙΑΚΗ ΔΙΕΥΘΥΝΣΗ ΙΟΝΙΩΝ ΝΗΣΩΝ",
    "ΠΕΡΙΦΕΡΕΙΑΚΗ ΔΙΕΥΘΥΝΣΗ ΚΕΝΤΡΙΚΗΣ ΜΑΚΕΔΟΝΙΑΣ",
    "ΠΕΡΙΦΕΡΕΙΑΚΗ ΔΙΕΥΘΥΝΣΗ ΚΡΗΤΗΣ",
    "ΠΕΡΙΦΕΡΕΙΑΚΗ ΔΙΕΥΘΥΝΣΗ ΝΟΤΙΟΥ ΑΙΓΑΙΟΥ",
    "ΠΕΡΙΦΕΡΕΙΑΚΗ ΔΙΕΥΘΥΝΣΗ ΠΕΛΟΠΟΝΝΗΣΟΥ",
    "ΠΕΡΙΦΕΡΕΙΑΚΗ ΔΙΕΥΘΥΝΣΗ ΣΤΕΡΕΑΣ ΕΛΛΑΔΑΣ"
]
`
const req8 = `
Παραδειγμα αιτήματος
http://localhost:5173/search?typos=ΓΕΝΙΚΗΣ&klados=ΠΕ70&perioxh=Β+ΑΘΗΝΑΣ&perioxh=Β+ΘΕΣΣΑΛΟΝΙΚΗΣ&perioxh=ΛΑΡΙΣΑΣ&perioxh=Α+ΠΕΙΡΑΙΑ
`
const resp8 = `
Παραδειγμα απάντησης
{
    "anaplirotesCount": {
        "labels": [
            "2018-2019",
            "2020-2021",
            "2021-2022",
            "2022-2023"
        ],
        "datasets": [
            {
                "label": "Β ΑΘΗΝΑΣ, ΓΕΝΙΚΗΣ, ΠΕ70",
                "data": [
                    106,
                    224,
                    183,
                    196
                ]
            },
            {
                "label": "Β ΘΕΣΣΑΛΟΝΙΚΗΣ, ΓΕΝΙΚΗΣ, ΠΕ70",
                "data": [
                    56,
                    8,
                    38,
                    186
                ]
            },
            {
                "label": "ΛΑΡΙΣΑΣ, ΓΕΝΙΚΗΣ, ΠΕ70",
                "data": [
                    15,
                    17,
                    2,
                    24
                ]
            },
            {
                "label": "Α ΠΕΙΡΑΙΑ, ΓΕΝΙΚΗΣ, ΠΕ70",
                "data": [
                    106,
                    104,
                    155,
                    146
                ]
            }
        ]
    },
    "minMoria": {
        "labels": [
            "2018-2019",
            "2020-2021",
            "2021-2022",
            "2022-2023"
        ],
        "datasets": [
            {
                "label": "Β ΑΘΗΝΑΣ, ΓΕΝΙΚΗΣ, ΠΕ70",
                "data": [
                    1.767,
                    92.93,
                    49.28,
                    21.98
                ]
            },
            {
                "label": "Β ΘΕΣΣΑΛΟΝΙΚΗΣ, ΓΕΝΙΚΗΣ, ΠΕ70",
                "data": [
                    0,
                    155.18,
                    45.08,
                    27.78
                ]
            },
            {
                "label": "ΛΑΡΙΣΑΣ, ΓΕΝΙΚΗΣ, ΠΕ70",
                "data": [
                    1.767,
                    141.05,
                    59.1,
                    42.5
                ]
            },
            {
                "label": "Α ΠΕΙΡΑΙΑ, ΓΕΝΙΚΗΣ, ΠΕ70",
                "data": [
                    0,
                    96.73,
                    42.68,
                    15.25
                ]
            }
        ]
    }
}
`
setTimeout(() => {
  Prism.highlightAll()
}, 10)
</script>

<template>
  <h1 class="text-center text-3xl font-bold mt-10">
    Web Api του eAnaplirotes
  </h1>
  <div class="ml-24 mt-10 w-[60rem]">
    <h2 class="text-xl font-semibold mb-5">
      Χρήση του API
    </h2>
    <p>Η χρήση του API είναι ελεύθερη και δωρεάν. Συστήνεται η αναφορά χρήσης του eAnaplirotes API στις εφαρμογές που αναπτύσσονται. Ο αναλυτικός κώδικας των endpoints υπάρχει σε repository του <a class="text-cyan-600" href="https://github.com/DimosSidiropoulos/eAnaplirotes">GitHub</a> </p>
  </div>
  <h2 class="text-center text-2xl font-bold mb-10 mt-10">
    Endpoints
  </h2>
  <div class="flex justify-center gap-40">
    <div>
      <h1 class="font-bold w-[45rem]">
        Endpoint τύπου POST για την αναζήτηση ονόματος  με την χρήση κάποιου χαρακτήρα
      </h1>
      <div class="flex items-center mt-3 mb-4 h-11 w-[30rem] rounded-md bg-gray-300">
        <div class="flex justify-center items-center m-3 py-1 px-8 w-10 rounded-lg bg-cyan-600 text-white ">
          POST
        </div>
        <p>
          /anaplirotes        body: {
          name: name.value
          }
        </p>
      </div>
      <div class="w-[40rem]">
        Δέχεται σαν body κάποιους χαρακτήρες και επιστρέφονται οι τιμές με τις οποίες αντιστιχούνται οι χαρακτήρες αυτοί.
      </div>
    </div>
    <div class="flex flex-col">
      <div>
        <pre class="language-json w-auto py-0">
      <code>{{ req1 }}</code>
    </pre>
      </div>
      <div>
        <pre class="language-json w-[30rem] h-96 py-0">
      <code>{{ resp1 }}</code>
    </pre>
      </div>
    </div>
  </div>
  <div class="flex justify-center gap-40">
    <div>
      <h1 class="font-bold w-[45rem]">
        Endpoint τύπου GET για την αναζήτηση αναφορών ενός ονόματος
      </h1>
      <div class="flex items-center mt-3 mb-4 h-11 w-[30rem] rounded-md bg-gray-300">
        <div class="flex justify-center items-center m-3 py-1 px-8 w-10 rounded-lg bg-cyan-600 text-white ">
          GET
        </div>
        <p>
          /onoma/:id
        </p>
      </div>
      <div class="w-[40rem]">
        Γίνεται χρήση της παραμέτρου id και επιστρέφονται όλες οι αναφορές αυτής από τα ονόματα που υπάρχουν στην βάση.
      </div>
    </div>
    <div class="flex flex-col">
      <div>
        <pre class="language-json flex justify-center items-center w-[30rem] py-0">
      <code>{{ req2 }}</code>
    </pre>
      </div>
      <div>
        <pre class="language-json w-[30rem] h-96 py-0">
      <code>{{ resp2 }}</code>
    </pre>
      </div>
    </div>
  </div>
  <div class="flex justify-center gap-40">
    <div>
      <h1 class="font-bold w-[45rem]">
        Endpoint τύπου GET για την αναζήτηση όλης της πληροφορίας για ένα συγκεκριμένο όνομα
      </h1>
      <div class="flex items-center mt-3 mb-4 h-11 w-[30rem] rounded-md bg-gray-300">
        <div class="flex justify-center items-center m-3 py-1 px-8 w-10 rounded-lg bg-cyan-600 text-white ">
          GET
        </div>
        <p>
          /user/:Eponymo/:Onoma/:Patronymo
        </p>
      </div>
      <div class="w-[40rem]">
        Γίνεται χρήση των παραμέτρων Επώνυμο, Όνομα, Πατρώνυμο και επιστρέφεται όλη η πληροφορία για τον συγκεκριμένο εκπαιδευτικό σε ένα array από objects, ένα για κάθε χρονιά.
      </div>
    </div>
    <div class="flex flex-col">
      <div>
        <pre class="language-json flex justify-center items-center w-[30rem] py-0">
      <code>{{ req3 }}</code>
    </pre>
      </div>
      <div>
        <pre class="language-json w-[30rem] h-96 py-0">
      <code>{{ resp3 }}</code>
    </pre>
      </div>
    </div>
  </div>
  <div class="flex justify-center gap-40">
    <div>
      <h1 class="font-bold w-[45rem]">
        Endpoint τύπου GET που αφορά τους τύπους εκπαίδευσης
      </h1>
      <div class="flex items-center mt-3 mb-4 h-11 w-[30rem] rounded-md bg-gray-300">
        <div class="flex justify-center items-center m-3 py-1 px-8 w-10 rounded-lg bg-cyan-600 text-white ">
          GET
        </div>
        <p>
          /typos
        </p>
      </div>
      <div class="w-[40rem]">
        Επιστρέφονται όλοι οι τύποι εκπαίδευσης που υπάρχουν στην βάση.
      </div>
    </div>
    <div class="flex flex-col">
      <div>
        <pre class="language-json flex justify-center items-center w-[30rem] py-0">
      <code>{{ req4 }}</code>
    </pre>
      </div>
      <div>
        <pre class="language-json w-[30rem] h-96 py-0">
      <code>{{ resp4 }}</code>
    </pre>
      </div>
    </div>
  </div>
  <div class="flex justify-center gap-40">
    <div>
      <h1 class="font-bold w-[45rem]">
        Endpoint τύπου GET που αφορά τους κλάδους εκπαίδευσης
      </h1>
      <div class="flex items-center mt-3 mb-4 h-11 w-[30rem] rounded-md bg-gray-300">
        <div class="flex justify-center items-center m-3 py-1 px-8 w-10 rounded-lg bg-cyan-600 text-white ">
          GET
        </div>
        <p>
          /klados
        </p>
      </div>
      <div class="w-[40rem]">
        Επιστρέφονται όλοι οι κλάδοι εκπαίδευσης που υπάρχουν στην βάση.
      </div>
    </div>
    <div class="flex flex-col">
      <div>
        <pre class="language-json flex justify-center items-center w-[30rem] py-0">
      <code>{{ req5 }}</code>
    </pre>
      </div>
      <div>
        <pre class="language-json w-[30rem] h-96 py-0">
      <code>{{ resp5 }}</code>
    </pre>
      </div>
    </div>
  </div>
  <div class="flex justify-center gap-40">
    <div>
      <h1 class="font-bold w-[45rem]">
        Endpoint τύπου GET που αφορά τις περιοχές τοποθέτησης
      </h1>
      <div class="flex items-center mt-3 mb-4 h-11 w-[30rem] rounded-md bg-gray-300">
        <div class="flex justify-center items-center m-3 py-1 px-8 w-10 rounded-lg bg-cyan-600 text-white ">
          GET
        </div>
        <p>
          /perioxh
        </p>
      </div>
      <div class="w-[40rem]">
        Επιστρέφονται όλες οι περιοχές τοποθέτησης που υπάρχουν στην βάση.
      </div>
    </div>
    <div class="flex flex-col">
      <div>
        <pre class="language-json flex justify-center items-center w-[30rem] py-0">
      <code>{{ req6 }}</code>
    </pre>
      </div>
      <div>
        <pre class="language-json w-[30rem] h-96 py-0">
      <code>{{ resp6 }}</code>
    </pre>
      </div>
    </div>
  </div>
  <div class="flex justify-center gap-40">
    <div>
      <h1 class="font-bold w-[45rem]">
        Endpoint τύπου GET για τις διευθύνσεις εκπαίδευσης
      </h1>
      <div class="flex items-center mt-3 mb-4 h-11 w-[30rem] rounded-md bg-gray-300">
        <div class="flex justify-center items-center m-3 py-1 px-8 w-10 rounded-lg bg-cyan-600 text-white ">
          GET
        </div>
        <p>
          /dieythynsh
        </p>
      </div>
      <div class="w-[40rem]">
        Επιστρέφονται όλες οι διευθύνσεις εκπαίδευσης που υπάρχουν στην βάση.
      </div>
    </div>
    <div class="flex flex-col">
      <div>
        <pre class="language-json flex justify-center items-center w-[30rem] py-0">
      <code>{{ req7 }}</code>
    </pre>
      </div>
      <div>
        <pre class="language-json w-[30rem] h-96 py-0">
      <code>{{ resp7 }}</code>
    </pre>
      </div>
    </div>
  </div>
  <div class="flex justify-center gap-40">
    <div>
      <h1 class="font-bold w-[45rem]">
        Endpoint τύπου GET που επιστρέφει πληροφορία με έναν συνδιασμό φιλτρων
      </h1>
      <div class="flex items-center mt-3 mb-4 h-11 w-[40rem] rounded-md bg-gray-300">
        <div class="flex justify-center items-center m-3 py-1 px-8 w-10 rounded-lg bg-cyan-600 text-white ">
          GET
        </div>
        <p>
          /search?typos={typ}&klados={klad}&perioxh={per}&dieythynsh={diey}
        </p>
      </div>
      <div class="w-[40rem]">
        Γίνεται χρήση των query parameters typos, klados, perioxh και dieythynsh και επιστρέφεται το πλήθος προσλήψεων αναπληρωτών για τα συγκεκριμένα φίλτρα ανά χρονιά. Σε περίπτωση που δοθεί ο klados και η perioxh μαζί τότε επιστρέφεται και δεύτερο dataset που αφορά τα ελάχιστα μόρια που χρειάστηκαν για να γίνει πρόσληψη στον συγκεκριμένο κλάδο, στην συγκεκριμένη περιοχή ανά χρονια. Τα δεδομένα που επιστρέφονται είανι συμβατα για γραφήματα του Chart.js.
      </div>
    </div>
    <div class="flex flex-col">
      <div>
        <pre class="language-json flex justify-center items-center w-[30rem] py-0">
      <code>{{ req8 }}</code>
    </pre>
      </div>
      <div>
        <pre class="language-json w-[30rem] h-96 py-0">
      <code>{{ resp8 }}</code>
    </pre>
      </div>
    </div>
  </div>
</template>

<style scoped>
/* Add any custom styles for your code block here */
</style>
